{
    "pid": "anthurium andraeanum 'madural orange'",
    "basic": {
        "floral_language": "Anthurium andraeanum\nAnthurium andraeanumFloriography: enthusiastic, bright, bold and unrestrained \nAnthurium andraeanumis one of the world precious flowers, cultivated from the flower kingdom of the Netherlands. \nAnthurium andraeanumflower such as fire, red bud is like a palm, tassel graceful palm a golden yellow flesh, vividly called spathe. Because of their enthusiasm is bold and unrestrained individual character, events like wedding or new store opening, choosing it as decoration, increase the festive atmosphere. \nAnthurium andraeanummaintenance is simple, can bloom all year round, flowering for 2-3 months.",
        "origin": "Holland",
        "production": "Yunnan",
        "category": "Araceae, Anthurium",
        "blooming": "Flowers year around with spathe flower, viewing period 2-3 months",
        "color": "Leaf color green , bract orange"
    },
    "display_pid": "Anthurium andraeanum 'Madural orange'",
    "maintenance": {
        "size": "Diameter ≥ 10 cm, height 16-20 cm",
        "soil": "Peat covered with a layer of sphagnum moss on soil surface to keep moisture",
        "sunlight": "Likes moderate sunlight, resistant to half shade",
        "watering": "Likes wet environments, water thoroughly when soil is dry, may spray water in the air or on leaves, reduce water in winter, keep soil moist",
        "fertilization": "Dilute fertilizers following instructions, apply 1-2 times monthly",
        "pruning": "Remove rotten roots, old diseased and dead leaves timely"
    },
    "parameter": {
        "max_light_mmol": 4800,
        "min_light_mmol": 2400,
        "max_light_lux": 35000,
        "min_light_lux": 1500,
        "max_temp": 32,
        "min_temp": 15,
        "max_env_humid": 85,
        "min_env_humid": 30,
        "max_soil_moist": 65,
        "min_soil_moist": 15,
        "max_soil_ec": 2000,
        "min_soil_ec": 350
    },
    "image": "C:\\Users\\Rick\\Downloads\\PlantImages\\Images\\anthurium andraeanum 'madural orange'.jpg"
}