{
    "pid": "pachyphytum cv.momobijin",
    "basic": {
        "floral_language": "Pachyphytum cv.Momobijin \nFloriography: lovely, beautiful, warm.\nPachyphytum is a small genus of succulents in the Crassulaceae family. The name comes from the ancient Greek pachys (thick) and phyton (plant) after the thick leaves. The so called P. 'Blue Haze' or P. cv. MOMOBIJIN is the hybrid of P. bracteosum and P. glutinicaule. This cultivar possesses pink thick oval leaves with white powder covered. It looks prettier from distance with the pink cloth. The shape and arrange of the leaves make the plant look like a blooming Indian lotus from bird eye's view. \nThe cultivar requires sunny habitat, turning white or green if it could not receive plenty of sunlight. Small red flowers bloom occasionally.",
        "origin": "Asia",
        "production": "China",
        "category": "Crassulaceae, Pachyphytum",
        "blooming": "Succulent plants, blooms sometimes, a long scape sprouts from the plant center, blooms with small red flowers in 5-pointed star shape",
        "color": "Leaf color pale pink or light purple"
    },
    "display_pid": "Pachyphytum cv.Momobijin",
    "maintenance": {
        "size": "Diameter ≥ 10 cm, height 10-15 cm",
        "soil": "Peat and akadama mixed in 3:1 ratio",
        "sunlight": "Like sunshine, no apparent dormancy in summer",
        "watering": "Do not water frequently, keep a dry environment, water every 7-10 days",
        "fertilization": "Dilute fertilizers following instructions, apply once monthly",
        "pruning": "Remove dead and rotten part timely"
    },
    "parameter": {
        "max_light_mmol": 7100,
        "min_light_mmol": 3400,
        "max_light_lux": 65000,
        "min_light_lux": 3200,
        "max_temp": 35,
        "min_temp": 8,
        "max_env_humid": 80,
        "min_env_humid": 15,
        "max_soil_moist": 50,
        "min_soil_moist": 7,
        "max_soil_ec": 1000,
        "min_soil_ec": 300
    },
    "image": "C:\\Users\\Rick\\Downloads\\PlantImages\\Images\\pachyphytum cv.momobijin.jpg"
}