{
    "pid": "paeonia tenuifolia",
    "basic": {
        "floral_language": "Paeonia tenuifolia\nFloriography: beautiful, warm, loyal \nPaeonia tenuifolia flower is a born beauty, equivalent to that of peony, who was a \" Paeonia suffruticosa is the king, and Paeonia tenuifolia is the prime minister”.\nPaeonia tenuifolia posture is elegant, flower shape is diverse, color is gorgeous, and scent. Besides used in home decoration and garden ornament, also can be used as a medicinal of heat-clearing and detoxifying. \nPaeonia tenuifolia like sunny places, natural flowering from May and June, viewing period 1 to 2 weeks for each flower. When flowers are wilted, trim withered leaves and flowers, waiting for germinate again in the coming year.",
        "origin": "China",
        "production": "China",
        "category": "Ranunculaceae, Paeonia",
        "blooming": "Flowering period May-June, viewing period 1-2 weeks",
        "color": "Flower color red, pink, purple, or in mixture"
    },
    "display_pid": "Paeonia tenuifolia",
    "maintenance": {
        "size": "Diameter ≥ 10 cm, height ≥ 15 cm",
        "soil": "Likes slightly alkaline soil, may use peat adding a small amount of lime or baking soda,",
        "sunlight": "Long-day plant, likes sunshine, but avoid scorching sunlight",
        "watering": "Water thoroughly when soil is drywater thoroughly when soil is dry, avoid saturated water",
        "fertilization": "Dilute fertilizers following instructions, apply 1-2 times monthly",
        "pruning": "Remove old, diseased, dead leaves and withered flowers timely"
    },
    "parameter": {
        "max_light_mmol": 7400,
        "min_light_mmol": 4400,
        "max_light_lux": 50000,
        "min_light_lux": 2000,
        "max_temp": 32,
        "min_temp": 8,
        "max_env_humid": 80,
        "min_env_humid": 30,
        "max_soil_moist": 60,
        "min_soil_moist": 15,
        "max_soil_ec": 2000,
        "min_soil_ec": 300
    },
    "image": "C:\\Users\\Rick\\Downloads\\PlantImages\\Images\\paeonia tenuifolia.jpg"
}